{
    "_id": {
      "$oid": "6653331bbca915d33fa27a2b"
    },
    "title": "مذہب کے نام پر جنونیت",
    "likes": [],
    "dislikes": [
      {
        "$oid": "665332e533b732d06d94ebe9"
      }
    ],
    "content": "جون کا مہینہ تھا شدید قسم کی گرمی سے مانو بے حال ہو رہی تھی پیاس سے برا حال اس پہ ستم کھانے کی تلاش میں جہاں جاتی ,دور سے ہی کبھی پتھر تو کبھی جوتا مار کر بھگا دی جاتی اور آج تو وہ تازہ مرغی کے گوشت کی خوشبو پا کر اسوہ کے گھر چلی گٸی دیکھا تو اس کی ماں تازہ گوشت سنک پہ رکھ کر صاف کر رہی ہے جسے دیکھ کر مانو کے منہ میں بھر بھر کے پانی آ گیا دروازے کے ایک کونے پہ لگ کر خوب میاٶں میاٶں کرنے لگی جیسے اپنی زباں میں اپنی موجودگی کااحساس دلا رہی ہو مگر چکن دھونے والی عورت اپنی دھن میں مگن اسے ان سنا کرتی رہی۔مانو جب بول بول کر تھک ہار گٸی تو بالاخر گوشت جھپٹنے کی کوشش کرنے کا سوچنے لگی اس کی یہ سوچ ابھی ادھوری تھی کہ ایک دس سال کا بچہ بھاگتا ہوا آیا اور اس نے رکھ کر جوتے کا نشانہ مانو کو دے مارا وہ بچاری اس اچانک حملے سے بوکھلا گٸی اور درد سے بلبلاتی دور جا گری جوتا ساٸز میں کافی بڑا تھا اور مارنے والا پوری طاقت میں تھا اس نے نہ آٶ دیکھا نہ تاٶ اپنا نشانہ ایک بے زباں کو بنایا۔ مانو بھوکی پیاسی  مایوسی و درد سے وہاں سے جانے لگی  تو مانو کے کان میں یہ الفاظ سناٸی دٸیے : ”ہاٸے ہاٸے اسفند کیا ضرورت تھی بے زبان کو مارنے کی! اتنے میں اس عورت نے ایک چکن پیس مانو کی طرف پھینک دیا مانو بچاری درد سے کراہتی واپس جاتے ہوٸے مڑ گٸی اور چکن پیس اٹھا کر اسفند کی نظر سے دور ہوگٸی جب کہ مانو دل ہی دل میں سوچ رہی تھی: ”کیا تھا یہ عورت مجھے پہلے ہی دے دیتی ! پھر جوتے سے لگی چوٹ کو سہلاتے ہوٸے کہنے لگی : کم بخت نے بہت زور سے مارا! مگر اگر وہ نہ مارتا تو اس کی ماں کو مجھ پہ رحم نہ آتا اور وہ کھانے کو مجھے کچھ نہ دیتی“۔ \nپیارے بچو! یہ ایک مانو کی کہانی نہیں ہے بلکہ ہمارے ارد گرد بے شمار ایسی مانو پھر رہی ہیں جو پیاس سے بے حال اور بھوک سے نڈھال ہیں زرا سوچٸیے ہمارے گھروں میں کتنے ایسے برتن ہیں جو بے کار پڑے رہتے ہیں سالہا سال استعمال ہی نہیں ہوتے آپ نے کرنا کیا ہے آپ نے اس برتن کو اچھی طرح دھو کر اس میں صاف پانی ڈال دینا ہے کہ جب بھی کوٸی مانو یا کوٸی بھی پرندہ آٸے تو وہ اپنی پیاس بجھا سکے سیراب ہو کر جاٸے اور رہی کھانے کی بات تو گھروں میں کتنا ہی کھانا بھی تو روز خراب ہو جاتا ہے اگر کلو گوشت بناتے ہیں توایک بوٹی مانو کے لیے رکھ دیں اس سے آپ کا بھی کچھ نہیں جاٸے گا اور مانو کا پیٹ بھی بھر جاٸے گا۔ \nبات ساری احساس کی ہے ایک منٹ کے لیے سوچیں اگر آپ بھی بے زبان اور بے گھر ہوتے تو یونہی لوگوں کے گھر جاتے اور اپنی بات انہیں سمجھانے کی کوشش کرتے اسی طرح انسان تو اشرف المخلوقات ہے اللہ نے اسے تمام مخلوق سے افضل بنایا ہے اسے مخنت کرنے کے الگ الگ طریقے سمجھاٸے اور طرح طرح کے کام بتاٸے جن کو بروٸے کار لاتے ہوٸے وہ اپنا پیٹ بھر سکتا ہے مگر جانور تو انسان کے مختاج ہے ناں وہ تو بچا کھچا تلاش کرنے میں لگے رہتے اس لیے فرمایا گیا ہے اپنے اردگرد کی مخلوق کا دھیان رکھیں پیارے ساتھیو کل قیامت والے دن ایک ایک نیکی کو ترسیں گے آج موقع ہے نیکی کر لیجیے:۔\n",
    "author": {
      "$oid": "665332e533b732d06d94ebe9"
    },
    "comments": [
      {
        "$oid": "66576c91a60309421c4c7bbd"
      },
      {
        "$oid": "66576cb3a60309421c4c7c07"
      },
      {
        "$oid": "665772a4a60309421c4c8278"
      },
      {
        "$oid": "6657e4bb8de8f87bd8ed364e"
      },
      {
        "$oid": "6657e4c78de8f87bd8ed365d"
      }
    ],
    "createdAt": {
      "$date": "2024-05-26T13:03:23.876Z"
    },
    "__v": 102,
    "nextPart": {
      "$oid": "6655cdf3a3da627aae981800"
    },
    "tags": [],
    "views": [
      {
        "$oid": "665332e533b732d06d94ebe9"
      }
    ]
  }